---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDir2Generic
source: html/ff300336-bb07-bcc7-0001-c6975783fd52.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemNumberOfLinesTopDir2Generic Property

"Top/Exterior Minor Number Of Lines"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemNumberOfLinesTopDir2Generic { get; }
```